{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "All-or-Nothing Thinking",
    "1": "Disqualifying the Positive",
    "2": "Emotional Reasoning",
    "3": "Jumping to Conclusions",
    "4": "Labeling and Mislabeling",
    "5": "Magnification and Minimization",
    "6": "Mental Filter",
    "7": "Overgeneralization",
    "8": "Personalization",
    "9": "Should Statements"
  },
  "initializer_range": 0.02,
  "label2id": {
    "All-or-Nothing Thinking": 0,
    "Disqualifying the Positive": 1,
    "Emotional Reasoning": 2,
    "Jumping to Conclusions": 3,
    "Labeling and Mislabeling": 4,
    "Magnification and Minimization": 5,
    "Mental Filter": 6,
    "Overgeneralization": 7,
    "Personalization": 8,
    "Should Statements": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.56.1",
  "vocab_size": 30522
}
